#include "../fclib.h"

const u8 Palette[] = { 
    COLOR_SKYBLUE, //!< 背景色
    COLOR_GREEN, COLOR_RED, COLOR_BLUE, //!< BG パレット 0
    0, //!< 未使用
    COLOR_RED, 0, 0, //!< BG パレット 1
    0, //!< 未使用
    COLOR_BLUE, 0, 0, //!< BG パレット 2
    0, //!< 未使用
    COLOR_YELLOW, 0, 0, //!< BG パレット 3
};

//0, 0, 0, 1, 1, 0, 0, 0,
//0, 0, 1, 1, 1, 1, 0, 0,
//0, 1, 1, 1, 1, 1, 1, 0,
//1, 1, 0, 1, 1, 0, 1, 1,
//1, 1, 1, 1, 1, 1, 1, 1,
//0, 0, 1, 0, 0, 1, 0, 0,
//0, 1, 0, 1, 1, 0, 1, 0,
//1, 0, 1, 0, 0, 1, 0, 1

//!< BG 用 8x8 x 256 種
const u8 PatternBG[] = {
    (0 & 1)<<7|(0 & 1)<<6|(0 & 1)<<5|(1 & 1)<<4|(1 & 1)<<3|(0 & 1)<<2|(0 & 1)<<1|(0 & 1)<<0,
    (0 & 1)<<7|(0 & 1)<<6|(1 & 1)<<5|(1 & 1)<<4|(1 & 1)<<3|(1 & 1)<<2|(0 & 1)<<1|(0 & 1)<<0,
    (0 & 1)<<7|(1 & 1)<<6|(1 & 1)<<5|(1 & 1)<<4|(1 & 1)<<3|(1 & 1)<<2|(1 & 1)<<1|(0 & 1)<<0,
    (1 & 1)<<7|(1 & 1)<<6|(0 & 1)<<5|(1 & 1)<<4|(1 & 1)<<3|(0 & 1)<<2|(1 & 1)<<1|(1 & 1)<<0,
    (1 & 1)<<7|(1 & 1)<<6|(1 & 1)<<5|(1 & 1)<<4|(1 & 1)<<3|(1 & 1)<<2|(1 & 1)<<1|(1 & 1)<<0,
    (0 & 1)<<7|(0 & 1)<<6|(1 & 1)<<5|(0 & 1)<<4|(0 & 1)<<3|(1 & 1)<<2|(0 & 1)<<1|(0 & 1)<<0,
    (0 & 1)<<7|(1 & 1)<<6|(0 & 1)<<5|(1 & 1)<<4|(1 & 1)<<3|(0 & 1)<<2|(1 & 1)<<1|(0 & 1)<<0,
    (1 & 1)<<7|(0 & 1)<<6|(1 & 1)<<5|(0 & 1)<<4|(0 & 1)<<3|(1 & 1)<<2|(0 & 1)<<1|(1 & 1)<<0,

    (0 & 2)<<7|(0 & 2)<<6|(0 & 2)<<5|(1 & 2)<<4|(1 & 2)<<3|(0 & 2)<<2|(0 & 2)<<1|(0 & 2)<<0,
    (0 & 2)<<7|(0 & 2)<<6|(1 & 2)<<5|(1 & 2)<<4|(1 & 2)<<3|(1 & 2)<<2|(0 & 2)<<1|(0 & 2)<<0,
    (0 & 2)<<7|(1 & 2)<<6|(1 & 2)<<5|(1 & 2)<<4|(1 & 2)<<3|(1 & 2)<<2|(1 & 2)<<1|(0 & 2)<<0,
    (1 & 2)<<7|(1 & 2)<<6|(0 & 2)<<5|(1 & 2)<<4|(1 & 2)<<3|(0 & 2)<<2|(1 & 2)<<1|(1 & 2)<<0,
    (1 & 2)<<7|(1 & 2)<<6|(1 & 2)<<5|(1 & 2)<<4|(1 & 2)<<3|(1 & 2)<<2|(1 & 2)<<1|(1 & 2)<<0,
    (0 & 2)<<7|(0 & 2)<<6|(1 & 2)<<5|(0 & 2)<<4|(0 & 2)<<3|(1 & 2)<<2|(0 & 2)<<1|(0 & 2)<<0,
    (0 & 2)<<7|(1 & 2)<<6|(0 & 2)<<5|(1 & 2)<<4|(1 & 2)<<3|(0 & 2)<<2|(1 & 2)<<1|(0 & 2)<<0,
    (1 & 2)<<7|(0 & 2)<<6|(1 & 2)<<5|(0 & 2)<<4|(0 & 2)<<3|(1 & 2)<<2|(0 & 2)<<1|(1 & 2)<<0,
};

u8 NesMain()
{
    int i;
    u8 KeyState = 0;
    u8 x, y;

    VSYNC();
    
    //!< 表示オフ
    PPUMASK = 0;
    
    //!< サウンド初期化
    PULSE1_CTRL1 = 0;
    PULSE1_CTRL2 = 0;
    PULSE2_CTRL1 = 0;
    PULSE2_CTRL2 = 0;
    TRIANGLE_CTRL = 0;
    NOISE_CTRL = 0;
    SNDCHANNEL = 0;

    //!< BG クリア (ネームテーブル)
    SET_PPUADDR(PPU_BG_A_NAMETBL_ADDR);
    for(i = 0;i < TILE_WIDTH * TILE_HEIGHT;++i) {
         PPUDATA = 0; 
    }
    for(i = 0;i < TILE_WIDTH * TILE_HEIGHT;++i) {
         PPUDATA = 0; 
    }
    //!< BG スクロール
    PPUSCROLL_BG(0, 0);
    PPUCTRL = PPUCTRL_SPR_PAT_TBL_1000 | PPUCTRL_BG_H(0);

    //!< BG パレット
    SET_PPUADDR(PPU_BG_PALETTE_ADDR);
    for(i = 0;i < COUNTOF(Palette);++i) {
        PPUDATA = Palette[i];
    }
    //!< BG パターン
    SET_PPUADDR(PPU_PATTERN_ADDR);
    for(i = 0;i < COUNTOF(PatternBG);++i) {
        PPUDATA = PatternBG[i];
    }
    //!< BG ネームテーブル

    //!< BG アトリビュート (ネームテーブルに対するパレット)
    //!< 2x2 の 4 つのグループ毎にパレットを 1 バイトで指定している
    //!< 01 23
    //!< 45 67
    //!< パレットは 16 / 4 の連番で使用することになる [0, 3] , [4, 7], [8, 11], [12, 15]
    //!< ↑には上位 2 ビットを指定して、連番の 4 パレットのどれを使用するかを指定する
    SET_PPUADDR(PPU_BG_A_ATTR_ADDR);
    for(i = 0;i < TILE_WIDTH * TILE_HEIGHT >> 2;++i){
        PPUDATA = 0x0;
    }
    //!< ネームテーブルは左上から右下へ配置されるのに、アトリビュートは 2x2(左上、右上、左下、右下)の順なのでややこしい 

    //!< 表示オン
    PPUMASK = PPUMASK_BG_DISP_ON | PPUMASK_BG_EDGE_ON;

    x = y = 0;
    while(1){
        KeyState = ReadJoypad1();
        if(BUTTON_UP & KeyState) { --y; }
        if(BUTTON_DOWN & KeyState) { ++y; }
        if(BUTTON_LEFT & KeyState) { --x; }
        if(BUTTON_RIGHT & KeyState){ ++x; }
        if(BUTTON_A & KeyState){}
        if(BUTTON_B & KeyState){}
        if(BUTTON_SELECT & KeyState){}
        if(BUTTON_START & KeyState){}

        VSYNC();

        //!< PPU 制御後、BG スクロール座標が変わってしまうので再設定する必要がある
        PPUSCROLL_BG(x, y);
        PPUCTRL = PPUCTRL_SPR_PAT_TBL_1000 | PPUCTRL_BG_H(x);
    }
    return 0;
}